{
    "title": "Cấu trúc câu hỏi đuôi trong tiếng Anh và cách sử dụng ",
    "description": "Cấu trúc câu hỏi đuôi được chia là 2 vế chính là “mệnh đề trần thuật” + “câu hỏi đuôi” (“statement”+ “tag question“). Như đã nói phía trên, nếu statement ở dạng khẳng định thì tag question sẽ ở dạng phủ định và ngược lại. ",
    "content": [
        {
            "title": "1 Cấu trúc chung của câu hỏi đuôi trong tiếng Anh",
            "text": "Tổng quát cấu trúc câu hỏi đuôi : S + V + O, trợ động từ + đại từ chủ ngữ của S?",
            "example": null,
            "image_url": "https://cdn2.hoclieuthongminh.com/public//images/TA11T2SHS/U9-L2-2-Gr-89c721ffc225aacea3a9cac64f0e8dce2662.jpg",
            "video_url": null
        },
        {
            "title": "Nguyên tắc thành lập câu hỏi đuôi:",
            "text": "Vế đằng trước là khẳng định (+) thì phần đuôi là phủ định (-).",
            "example": [
                {
                    "original": "We are going to the park, aren't we?",
                    "explanation": "Chúng ta sẽ đi công viên, phải không?"
                },
                {
                    "original": "You are coming to the party, aren't you?",
                    "explanation": "Bạn sẽ đến dự tiệc, phải không?"
                },
                {
                    "original": "The book is interesting, isn't it?",
                    "explanation": "Cuốn sách này hay, phải không?"
                },
                {
                    "original": "You studied hard for the exam, didn't you?",
                    "explanation": "Bạn đã học hành chăm chỉ cho kỳ thi, phải không?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Vế đằng trước là phủ định (-) thì phần đuôi là khẳng định (+).",
            "example": [
                {
                    "original": "You haven't finished your homework yet, have you?",
                    "explanation": "Bạn chưa làm xong bài tập về nhà phải không?"
                },
                {
                    "original": "We didn't go to the cinema last night, did we?",
                    "explanation": "Chúng ta không đi xem phim tối qua phải không?"
                },
                {
                    "original": "You aren't busy now, are you?",
                    "explanation": "Bạn không bận bây giờ phải không?"
                },
                {
                    "original": "They weren't ready on time, were they?",
                    "explanation": "Họ không đến đúng giờ phải không?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": "2 Cách dùng câu hỏi đuôi",
            "text": "Bảng tổng hợp câu hỏi đuôi với các thì trong tiếng Anh",
            "image_url": "images/objects/tag_question/chd.png",
            "example": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Bảng tổng hợp câu hỏi đuôi với động từ khuyết thiếu",
            "example": null,
            "image_url": "https://talkfirst.vn/wp-content/uploads/2024/02/vi-du-cau-hoi-duoi-voi-modal-verb-944x1024.jpg",
            "video_url": null
        },
        {
            "title": "3 Các trường hợp câu hỏi đuôi đặc biệt",
            "text": "1. Câu hỏi đuôi với trạng từ phủ định: Khi trong câu xuất hiện các trạng từ mang ý nghĩa phủ định như never, barely, rarely, hardly, seldom, scarcely,… thì cả câu hỏi đuôi và mệnh đề chính đều ở dạng khẳng định. ",
            "example": [
                {
                    "original": "Duy barely spends time learning English, does he?",
                    "explanation": "Duy hầu như không dành thời gian học tiếng Anh, phải không?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "2. Câu hỏi đuôi với câu mệnh lệnh, lời mời, lời đề nghị: Trong câu đề nghị, mệnh lệnh hay lời mời, người ta thường sử dụng thêm câu hỏi đuôi để tăng sự lịch sự và thân thiện. Khi đó, câu hỏi đuôi cho dạng này sẽ sử dụng kèm các trợ động từ là: will, can, could, would.",
            "example": [
                {
                    "original": "Don't move the table, will you?",
                    "explanation": "Đừng di chuyển cái bàn, được không?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "3. Câu hỏi đuôi với Let: Trong câu hỏi đuôi có chứa mệnh đề chính bắt đầu bằng “Let” thì phần đuôi sẽ sử dụng cụm từ mặc định là 'shall we?' khi mang nghĩa rủ rê, 'may I?' khi đề nghị giúp đỡ và 'will you' với ý nghĩa xin phép.",
            "example": [
                {
                    "original": " Let's have a smoothie, shall we?",
                    "explanation": "Chúng ta hãy uống sinh tố nhé?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "4. Câu hỏi đuôi cùng hướng (Same-way tag question): Trong câu hỏi đuôi cùng hướng (Same-way tag question), cả mệnh đề chính và câu hỏi đuôi sẽ cùng ở dạng khẳng định hoặc phủ định, nhằm mang nghĩa nhấn mạnh cảm xúc bất ngờ, tức giận,... của người nói.",
            "example": [
                {
                    "original": "So you are having a baby, are you? That's great!",
                    "explanation": "Vậy là bạn sắp có em bé phải không? Thật tuyệt quá!"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "5. Câu hỏi đuôi với There: Trong trường hợp mệnh đề chính bắt đầu bằng 'There', phần câu hỏi đuôi sẽ dùng chính chủ ngữ này kèm theo động từ có sẵn ở mệnh đề chính ở dạng phủ định.",
            "example": [
                {
                    "original": " There is a beautiful park near your company, isn't there?",
                    "explanation": "Có một công viên đẹp gần công ty của bạn, phải không?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "6. Cấu trúc câu hỏi đuôi với đại từ bất định:nobody, no one, none of,...;nothing;everyone, everybody, someone, anyone, anybody,...;something, everything, anything, that, this",
            "example": [
                {
                    "original": "Nobody is late for work today, are they?",
                    "explanation": "Hôm nay không ai đi làm muộn phải không?"
                },
                {
                    "original": "Nothing will make her change his mind, will it?",
                    "explanation": "Sẽ không có gì khiến cô ấy thay đổi quyết định, phải không?"
                },
                {
                    "original": "Somebody has quit the job, haven't they?",
                    "explanation": " Ai đó đã nghỉ việc, phải không?"
                },
                {
                    "original": "Something is smelly in my room, isn’t it?",
                    "explanation": "Có gì đó có mùi trong phòng của tôi, phải không?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "7. Câu hỏi đuôi của chủ ngữ “I” + động từ trần thuật + mệnh đề phụ",
            "example": null,
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Trong trường hợp mệnh đề chính bắt đầu bằng chủ ngữ “I” kết hợp với các động từ trần thuật như think, believe, expect, reckon,... thì người học phải sử dụng câu hỏi đuôi dựa vào phần mệnh đề phụ. ",
            "image_url": null,
            "example": [
                {
                    "original": " I think he will win the 2023 international math contest, won't he?",
                    "explanation": "Tôi nghĩ anh ấy sẽ giành chiến thắng trong cuộc thi toán quốc tế năm 2023 nhỉ?"
                }
            ],
            "video_url": null
        },
        {
            "title": null,
            "text": "Trong trường hợp chủ ngữ của mệnh đề chính không phải đại từ nhân xưng “I” thì câu hỏi đuôi được hình thành dựa vào động từ theo sau chủ ngữ chính đó.",
            "image_url": null,
            "example": [
                {
                    "original": "People expect that the talented woman will become the new mayor, don't they?",
                    "explanation": "Mọi người mong đợi rằng người phụ nữ tài giỏi sẽ trở thành thị trưởng mới, phải không?"
                }
            ],
            "video_url": null
        },
        {
            "title": null,
            "text": "8. Câu hỏi đuôi của Used to: Nếu mệnh đề chính có cấu trúc là “used to + V” thì câu hỏi đuôi là sẽ có dạng cố định là “didn't + S” và ngược lại.",
            "example": [
                {
                    "original": "He used to study abroad in Melbourne, Australia, didn't he?",
                    "explanation": "Anh ấy đã từng đi du học ở Melbourne, Australia phải không?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "9. Câu hỏi đuôi của Had better/Would rather: Nếu mệnh đề chính có cấu trúc là “had better/would rather + V” thì câu hỏi đuôi là sẽ có dạng cố định là “hadn't/wouldn’t + S”.",
            "example": [
                {
                    "original": "You had better move to a new high school, hadn't you?",
                    "explanation": "Bạn nên chuyển đến một trường trung học mới, phải không?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "10. Câu hỏi đuôi của câu cảm thán: Nếu mệnh đề chính của câu hỏi đuôi là một câu cảm thán, phần đuôi của câu này sẽ được cấu tạo bởi đại từ dựa vào danh từ của mệnh đề chính và động từ chia theo dạng am/is/are phù hợp.",
            "example": [
                {
                    "original": "How cute these dogs are, aren't they?",
                    "explanation": "Những chú chó này thật dễ thương phải không?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "11. Câu hỏi đuôi của Wish: Nếu mệnh đề chính có là một câu sử dụng động từ wish thì câu hỏi đuôi là sẽ có dạng cố định là 'may + S'.",
            "example": [
                {
                    "original": " Linh wishes she had not refused that company's proposal, may she?",
                    "explanation": "Linh ước gì cô ấy đã không từ chối lời đề nghị của công ty đó, phải không?"
                }
            ],
            "image_url": null,
            "video_url": null
        }
    ]
}