{
    "title": "PHÂN LOẠI ĐỘNG TỪ THEO Ý NGHĨA MÀ CHÚNG THỂ HIỆN",
    "description": "Động từ trong tiếng Anh được phân loại theo ý nghĩa mà chúng thể hiện. Chúng ta hãy tìm hiểu một số cách phân loại động từ theo ý nghĩa mà chúng thể hiện nhé!",
    "content": [
        {
            "title": "Động từ chỉ hành động (Action verbs)",
            "text": "Động từ chỉ hành động (Action verbs) là những từ dùng để chỉ điều mà chủ thể trong câu chủ động thực hiện. Từ định nghĩa trên, có thể thấy được rằng những từ này thường xuất hiện trong những trường hợp như kể, miêu tả hành động,…\nMột số từ chỉ hành động thông dụng bao gồm: visit, travel, put, move, eat, drink, …",
            "example": [
                {
                    "original": "I visit my grandparents every week.",
                    "explanation": "Tôi tới thăm ông bà hàng tuần."
                },
                {
                    "original": "Holmes travelled to the Buckingham Palace.",
                    "explanation": "Ông Holmes đi tới cung điện Buckingham."
                },
                {
                    "original": "The waiter puts the cup of coffee on my table.",
                    "explanation": "Người phục vụ đặt ly cà phê lên bàn tôi."
                },
                {
                    "original": "The children move the teapot towards me.",
                    "explanation": "Những đứa trẻ chuyển ấm trà về phía tôi."
                },
                {
                    "original": "The woman eats the whole lobster in her dinner.",
                    "explanation": "Người phụ nữ ăn cả con tôm hùm trong bữa tối."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Ngoài việc đơn thuần diễn đạt hành động của chủ ngữ, các động từ (verb) này còn diễn đạt cả hình thái (manner) mà các hành động này thể hiện.",
            "example": [
                {
                    "original": "The man goes to his office",
                    "explanation": "Người đàn ông đi tới văn phòng của mình."
                },
                {
                    "original": "The man runs to his office.",
                    "explanation": "Người đàn ông chạy tới văn phòng của mình."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Trong hai câu trên, cả hai động từ (verb) đều diễn đạt hành động di chuyển tới chỗ làm của người đàn ông. Tuy nhiên câu thứ hai thể hiện rõ hơn trạng thái của hành động này (chạy thay vì đi), cho thấy rằng người đàn ông đang di chuyển tới văn phòng với tốc độ nhanh, có thể là do trễ giờ làm.",
            "example": [
                {
                    "original": "Sue heard the music on her way home.",
                    "explanation": "Sue nghe thấy âm nhạc trên đường về nhà."
                },
                {
                    "original": "Sue listened to music on her way home.",
                    "explanation": "Sue nghe nhạc trên đường về nhà."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Tương tự như ví dụ trên, cả hai câu đều diễn đạt hành động Sue nghe nhạc trên đường về nhà. Tuy nhiên câu thứ nhất từ “hear” mang nghĩa rằng hành động nghe này chỉ là tình cờ (có thể một ai đó trên đường bật nhạc và Sue nghe được) còn ở câu thứ 2 từ “listen” mang nghĩa Sue là người có ý muốn nghe nhạc và tập trung vào việc đó.",
            "example": null,
            "image_url": "images/objects/verb/dong-tu-chi-hanh-dong-action-verbs.jpg",
            "video_url": null
        },
        {
            "title": "Động từ chỉ trạng thái (Stative verbs)",
            "text": "Động từ chỉ trạng thái (Stative verbs) là những từ dùng để nói về cảm giác, cảm xúc, sự sở hữu, phẩm chất của chủ thể (Herring, 240). Những từ này thường bao gồm động từ to be hoặc chỉ giác quan.",
            "example": [
                {
                    "original": "Her answer is wrong.",
                    "explanation": "Câu trả lời của cô ấy là sai."
                },
                {
                    "original": "I feel terrible these days.",
                    "explanation": "Tôi cảm thấy tồi tệ những ngày này."
                },
                {
                    "original": "The food smells.",
                    "explanation": "Món ăn có mùi thơm."
                },
                {
                    "original": "The picture looks.",
                    "explanation": "Bức tranh trông khá đẹp."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Bao gồm: Động từ tobe, động từ chỉ giác quan (Sense verb), động từ chỉ cảm xúc, động từ sở hữu (Possessive verb), động từ chỉ nhận thức (Cognition verb).",
            "example": null,
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Động từ to be thường được sử dụng để diễn đạt trạng thái về cảm xúc, địa điểm, thời gian, tình trạng thể chất, tâm lý hoặc đặt tên cho chủ thể trong câu.",
            "example": [
                {
                    "original": "That guy is 170 centimetres tall.",
                    "explanation": "Người đó cao 170 cm."
                },
                {
                    "original": "The babies are hungry. ",
                    "explanation": "Mấy đứa nhỏ đang đói.)"
                },
                {
                    "original": "We are quite happy now. ",
                    "explanation": "Chúng tôi khá hạnh phúc bây giờ."
                },
                {
                    "original": "He is depressed after his failure.",
                    "explanation": "Anh ấy chán nản sau thất bại của mình."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Động từ chỉ giác quan dùng để chỉ cảm nhận của của chủ thể trong câu đối với những đối tượng/ môi trường xung quanh.\nCác động từ chỉ giác quan bao gồm: feel, smell, sound, seem, look, appear, taste.\nTrong hầu hết các trường hợp, các động từ (verb) này sẽ được theo sau bởi một tính từ.",
            "example": [
                {
                    "original": "The cake smells awful.",
                    "explanation": "Chiếc bánh có mùi khủng khiếp."
                },
                {
                    "original": "The picture looks great.",
                    "explanation": "Bức tranh trông tuyệt vời."
                },
                {
                    "original": "Our new dish tastes really good.",
                    "explanation": "Món ăn mới của chúng tôi thực sự ngon."
                },
                {
                    "original": "I don’t know what it really is, but it sounds.",
                    "explanation": "Tôi không biết nó thực sự là gì, nhưng nó nghe có vẻ kinh khủng."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Động từ chỉ cảm xúc là những từ chỉ cảm giác chủ quan của chủ ngữ đối với một người, sự vật hoặc sự việc xung quanh. Trong hầu hết các trường hợp những động từ này có thể được theo sau bởi một danh từ, V-ing hoặc to-V với nghĩa không đổi.",
            "example": [
                {
                    "original": "I like that store.",
                    "explanation": "Tôi thích cửa hàng đó."
                },
                {
                    "original": "We really like studying with this teacher.",
                    "explanation": "Chúng tôi thực sự thích học với thầy giáo này."
                },
                {
                    "original": "My brother hates eating fish. ",
                    "explanation": "Anh trai tôi ghét ăn cá."
                },
                {
                    "original": "Many people now prefer using laptop to desktop.",
                    "explanation": "Nhiều người bây giờ thích sử dụng laptop hơn là máy tính để bàn."
                }
            ],
            "image_url": null,
            "video_url": null
        }
    ]
}