{
    "title": "Cách dùng lượng từ trong tiếng Anh",
    "description": "Có rất nhiều lượng từ trong tiếng Anh, bài học này sẽ hướng dẫn bạn học theo các cặp lượng từ tương tự với nhau về hình thức và ngữ nghĩa. Học bằng cách so sánh này sẽ giúp bạn dễ hiểu và nhớ lâu hơn. ",
    "content": [
        {
            "title": "1. Cách dùng Few - A Few",
            "text": "Few và a few là các lượng từ sẽ đứng trước danh từ đếm được số nhiều: Few/A few + N đếm được số nhiều + V (số nhiều)",
            "example": [
                {
                    "original": "The house is full of people. However, there are still a few rooms for my crew. ",
                    "explanation": "Căn nhà đầy người rồi. Tuy nhiên, vẫn có đủ phòng cho đoàn của tôi"
                },
                {
                    "original": "There were only a few chairs in the dining room.",
                    "explanation": "Chỉ có 1 vài cái ghế trong phòng ăn thôi."
                }
            ],
            "image_url": "https://langmaster.edu.vn/storage/images/2022/10/10/luong-tu-1.webp",
            "video_url": null
        },
        {
            "title": "2. Cách dùng Little - A Little",
            "text": "Little và a little là các lượng từ sẽ đứng trước danh từ không đếm được: Little/A little + N không đếm được + V (số ít)",
            "example": [
                {
                    "original": "There is little sugar in my juice.",
                    "explanation": "Có rất ít đường trong nước ép hoa quả của tôi."
                },
                {
                    "original": "We’ve got a little time before the teacher comes.",
                    "explanation": "Chúng ta còn một ít thời gian trước khi giáo viên tới."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": "3. Cách dùng Some",
            "text": "Some đứng trước danh từ đếm được có nghĩa là một vài; Some đứng trước danh từ không đếm được có nghĩa là một ít (câu khẳng định).",
            "example": [
                {
                    "original": "I want to buy some new books.",
                    "explanation": "Tôi muốn mua vài quyển sách mới."
                },
                {
                    "original": "Some friend hid my backpack.",
                    "explanation": "Một đứa bạn nào đó đã giấu cái balo của tôi."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": "4. Cách dùng Any",
            "text": "Any đứng trước danh từ đếm được số nhiều có nghĩa là một vài; Any đứng trước danh từ không đếm được có nghĩa là một ít. Trong câu dạng khẳng định, any có nghĩa là bất cứ cái nào, bất cứ ai, bất cứ cái gì.",
            "example": [
                {
                    "original": " I wish I could buy any cars I want.",
                    "explanation": "Tôi ước mình có thể mua bất cứ cái ô tô nào tôi muốn."
                },
                {
                    "original": "Any teacher tells you that students learn at different rates.",
                    "explanation": "Bất kì giáo viên nào cũng sẽ nói với bạn rằng học sinh nhớ kiến thức theo tốc độ khác nhau."
                }
            ],
            "image_url": "https://langmaster.edu.vn/storage/images/2022/10/10/luong-tu-2.webp",
            "video_url": null
        },
        {
            "title": "5. Cách dùng Much",
            "text": "Much đứng trước các danh từ số ít không đếm được; trong các câu thể nghi vấn và phủ định",
            "example": [
                {
                    "original": "Is there much brown sugar left in the fridge?",
                    "explanation": "Có còn nhiều đường nâu trong tủ lạnh không?"
                },
                {
                    "original": "My parents didn’t eat much fast food.",
                    "explanation": "Bố mẹ tôi không ăn nhiều đồ ăn nhanh."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": "6. Cách dùng Many",
            "text": "Many đứng trước các danh từ số nhiều đếm được; dùng trong câu thể phủ định và nghi vấn.",
            "example": [
                {
                    "original": "Many people came to the grand opening.",
                    "explanation": "Nhiều người tới buổi khai trương chính thức."
                },
                {
                    "original": "How many wallets do you have?",
                    "explanation": "Bạn có bao nhiêu cái ví?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": "7.  Cách dùng None",
            "text": "None có nghĩa là: không, không cái nào, không việc gì. None có chức năng đại từ, thay thế cho danh từ. None có thể được dùng như chủ ngữ hoặc tân ngữ.",
            "example": [
                {
                    "original": " He invited 2 ex-girlfriends, but none came to attend his wedding.",
                    "explanation": "Anh ta mời 2 cô người yêu cũ nhưng không cô nào đến tham dự đám cưới của anh ấy."
                },
                {
                    "original": "Who is absent today? – None.",
                    "explanation": "Có ai vắng mặt ngày hôm nay không? – Không có ai vắng."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": "8. Cách dùng No",
            "text": "No khi là lượng từ mang nghĩa là: không, không có. No đứng trước danh từ đếm được và không đếm được.",
            "example": [
                {
                    "original": "Janet had no other choice but agree with her parents' plan.",
                    "explanation": "Janet không còn cách nào khác nữa ngoài việc phải đồng ý với kế hoạch bố mẹ mình đã đề ra."
                },
                {
                    "original": "There is no point yelling, no one's here.",
                    "explanation": "Kêu gào cũng không được tác dụng gì đâu, làm gì có ai ở đây đâu."
                }
            ],
            "image_url": "https://langmaster.edu.vn/storage/images/2022/10/10/luong-tu-3.webp",
            "video_url": null
        },
        {
            "title": "9. Cách dùng Enough",
            "text": "Enough có nghĩa là “đủ”; enough đứng trước cả danh từ đếm được và không đếm được. Enough có thể dùng trong câu khẳng định, phủ định và nghi vấn.",
            "example": [
                {
                    "original": "You’ll never have enough money to buy this house",
                    "explanation": "Ông sẽ không bao giờ có đủ tiền mua cái nhà này đâu"
                },
                {
                    "original": "Do you have enough time to finish this project today?",
                    "explanation": "Hôm nay cậu có đủ thời gian để hoàn thiện dự án không?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": "10. Cách dùng Less",
            "text": "Less có nghĩa là ít hơn, đứng trước các danh từ số ít không đếm được.",
            "example": [
                {
                    "original": "He was advised to drink less beer.",
                    "explanation": "Anh ấy được khuyên là uống ít bia hơn."
                },
                {
                    "original": "The Red team has less of a chance competing with the Blue team.",
                    "explanation": "Đội Đỏ có ít cơ hội cạnh tranh với đội Xanh."
                }
            ],
            "image_url": "https://langmaster.edu.vn/storage/images/2022/10/10/luong-tu-4.webp",
            "video_url": null
        },
        {
            "title": "11. Cách dùng A large number of, Plenty of, A great number of, A lot of, Lots of",
            "text": "Tất cả các lượng từ này đều có nghĩa là “nhiều”. Các Quantifier này tương tự như much và many nhưng dùng trong câu khẳng định với nghĩa trang trọng.",
            "example": [
                {
                    "original": "It’s Friday, a lot of people are going out.",
                    "explanation": "Hôm nay là thứ 6, rất nhiều người sẽ ra ngoài chơi."
                },
                {
                    "original": "Plenty of leaves are on the ground.",
                    "explanation": "Có rất nhiều lá ở trên mặt đất."
                },
                {
                    "original": "My mom has a great deal of work to worry about.",
                    "explanation": "Mẹ tôi có hàng tá việc để phải lo lắng."
                },
                {
                    "original": "Yes, we did spend lots of money on shoes.",
                    "explanation": "Phải, chúng tôi đã tốn rất nhiều tiền cho những đôi giày."
                }
            ],
            "image_url":null,
            "video_url": null
        }
    ]
}