{
    "title": " Future continuous- Thì tương lai tiếp diễn",
    "description": "Thì tương lai tiếp diễn (Future Continuous tense) là thì dùng để diễn tả một hành động, sự việc diễn ra tại một thời điểm nhất định trong tương lai. ",
    "content": [
        {
            "title": "Công thức thì tương lai tiếp diễn",
            "text": null,
            "image_url": "https://langmaster.edu.vn/storage/images/2022/10/05/thi-tuong-lai-tiep-dien-future-continuous.webp",
            "example": null,
            "video_url": null
        },
        {
            "title": " 1. Thể khẳng định: ",
            "text": " Cấu trúc: S + will + be + V-ing",
            "example": [
                {
                    "original": "I will be staying in Ho Chi Minh city at 7p.m tomorrow.",
                    "explanation": "Tôi sẽ đang ở thành phố Hồ Chí Minh lúc 7 giờ chiều mai"
                },
                {
                    "original": "I will be meeting my grandparents at 8pm tomorrow ",
                    "explanation": "Tôi sẽ đang thăm ông bà của mình lúc 8 giờ ngày mai"
                }
            ],
            "image_url":null,
            "video_url": null
        },
        {
            "title":"2. Thể phủ định:",
            "text": "Cấu trúc: S + will + not + be + V-ing",
            "example": [
                {
                    "original": "My friends will not be arriving at this time tomorrow.",
                    "explanation": "Bạn của tôi sẽ đang không đến vào lúc này ngày mai"
                },
                {
                    "original": "I won't be cooking at home at 10 o'clock tomorrow because I have to meet a client. ",
                    "explanation": "Tôi sẽ không đang nấu cơm ở nhà lúc 10 giờ ngày mai bởi vì tôi phải đi gặp khách hàng."
                }
            ],
            "image_url":"https://langmaster.edu.vn/storage/images/2022/10/05/thi-tuong-lai-tiep-dien-3.webp",
            "video_url": null
        },
        {
            "title": " 3. Thể nghi vấn ",
            "text": " Cấu trúc: Câu hỏi Yes/No question: Will + S + be + V-ing?",
            "example": [
                {
                    "original": " Will you be joining our team next Tuesday?",
                    "explanation": "Bạn sẽ đang tham gia vào nhóm của bọn mình vào thứ ba tuần tới chứ?"
                },
                {
                    "original": "Will you be traveling next Friday?",
                    "explanation": "Bạn sẽ đang đi du lịch vào thứ 6 tháng tới phải không?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": "4. Thể nghi vấn dùng Wh-question",
            "text": "Cấu trúc: Wh-question + will + S + be + V-ing?",
            "example":  [
                {
                    "original": "Where will you be staying when we leave here tomorrow? ",
                    "explanation": "Bạn sẽ đang đi du lịch vào thứ 6 tháng tới phải không?"
                }
            ],
            "image_url":null,
            "video_url": null
        },
        {
            "title": "Cách dùng của thì tương lai tiếp diễn",
            "text": "1.Diễn tả một hành động, sự việc đang diễn ra tại một thời điểm cụ thể, hay một khoảng thời gian trong tương lai.",
            "example":  [
                {
                    "original": "I will be playing volleyball with Lan at 10 a.m tomorrow. ",
                    "explanation": "Tớ sẽ đang chơi bóng chuyền với Lan vào 10 giờ sáng mai"
                }
            ],
            "image_url":null,
            "video_url": null
        },
        {
            "title": null,
            "text": "2. Dùng để diễn tả một hành động, sự việc đang diễn ra trong tương lai thì có một hành động, sự việc khác xen vào.",
            "example": [
                {
                    "original": "When I go to school tomorrow, my friends will be having breakfast.",
                    "explanation": "Khi tôi đi học vào ngày mai, bạn của tôi sẽ đang ăn sáng."
                }
            ],
            "image_url":null,
            "video_url": null
        },
        {
            "title":null,
            "text": "3. Diễn tả một hành động, sự việc sẽ xảy ra, kéo dài liên tục trong tương lai.",
            "example":  [
                {
                    "original": "I will be going on a business trip for 1 month. Therefore, I am very worried about my dogs.",
                    "explanation": "Tôi sẽ đi công tác trong vòng 1 tháng. Vì thế, tôi rất lo cho những chú chó của mình."
                }
            ],
            "image_url":null,
            "video_url": null
        },
        {
            "title":null,
            "text": "4. Diễn tả một hành động, sự việc sẽ diễn ra theo thời gian biểu, hoặc lịch trình trong tương lai.",
            "example":  [
                {
                    "original": " The meeting will be starting as the plan at 9 a.m tomorrow. ",
                    "explanation": "Buổi họp sẽ đang bắt đầu như kế hoạch vào 9 giờ sáng mai"
                }
            ],
            "image_url":null,
            "video_url": null
        },
        {
            "title":null,
            "text": "5. Dùng để diễn tả những hành động xảy ra song song với nhau, nhằm mô tả không khí, khung cảnh tại một thời điểm nhất định trong tương lai.",
            "example":  [
                {
                    "original": "When I go to school, the teacher is giving a lecture. The teacher will be teaching math, and the students are going to be studying hard.",
                    "explanation": "Khi tôi đến trường, cô giáo đang giảng bài. Cô giáo sẽ đang giảng bài toán, còn học sinh thì đang học bài chăm chỉ."
                }
            ],
            "image_url":null,
            "video_url": null
        },
        {
            "title":null,
            "text": "6. Kết hợp với still nhằm chỉ các hành động xảy ra ở hiện tại và được cho là sẽ tiếp diễn trong tương lai.",
            "example":  [
                {
                    "original": "Yesterday he stayed up late, for sure tomorrow he will be very tired",
                    "explanation": "Hôm qua anh ấy thức khuya, chắc chắn ngày mai anh ấy sẽ rất mệt mỏi."
                }
            ],
            "image_url":"https://langmaster.edu.vn/storage/images/2022/10/05/thi-tuong-lai-tiep-dien-4.webp",
            "video_url": null
        },
        {
            "title": "Dấu hiệu thì tương lai tiếp diễn trong tiếng Anh",
            "text": "At this time/ at this moment + thời gian trong tương lai",
            "example": [
                {
                    "original": "At this moment next week, I will be camping with my best friends in the city park.",
                    "explanation": "Vào lúc 8 giờ sáng mai, gia đình tôi sẽ đang tham dự lễ tốt nghiệp của tôi"
                }
            ],
            "image_url":null,
            "video_url": null
        },
        {
            "title": null,
            "text": " When + mệnh đề chia ở thì hiện tại đơn.",
            "example":[
                {
                    "original": "When Lily comes tomorrow, Jame will be playing a video game in his room.",
                    "explanation": "Khi Lily đến vào ngày mai, Jame sẽ đang chơi trò chơi điện tử trong phòng"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": " Trong câu có xuất hiện những từ như: in the future, next time, next week, next year, soon,…",
            "example":[
                {
                    "original": "Next week, I will be going to the movies on Sunday ",
                    "explanation": "Tuần tới, tôi sẽ đi xem phim vào chủ nhật"
                }
            ],
            "image_url": "https://langmaster.edu.vn/storage/images/2022/10/05/thi-tuong-lai-tiep-dien-5.webp",
            "video_url": null
        }
    ]
}