{
    "title": "Past Continuous- Thì Quá Khứ Tiếp Diễn",
    "description": "Quá khứ tiếp diễn tuy không phổ biến nhưng lại là loại thì không thể thiếu trong các bài thi. Nhiều người chủ quan và bỏ qua phần kiến thức này, cho rằng không quan trọng. Đó là nguyên nhân dẫn đến việc không thể phân biệt các thì cơ bản trong tiếng Anh và sử dụng đúng. Trong bài viết này sẽ giúp bạn làm chủ thì quá khứ tiếp diễn.",
    "content": [
        {
            "title": "Khái niệm thì quá khứ tiếp diễn (Past continuous)",
            "text":"Quá khứ tiếp diễn (Past continuous) thường được sử dụng để diễn tả, nhấn mạnh quá trình của sự việc hoặc hành động. Nó còn thể hiện tính chất của một sự việc kéo dài trong quá khứ và không còn tiếp diễn ở hiện tại.",
            "image_url": "https://langmaster.edu.vn/storage/images/2022/10/06/qua-khu-tiep-dien-past-continuous.webp",
            "example": [
                {
                    "original": "They were just talking about it before I arrived.",
                    "explanation": "Họ đang nói về chuyện đó ngay trước khi tôi tới"
                },
                {
                    "original": "At 9 am yesterday, I was calling my mom.",
                    "explanation": "Vào lúc 9 giờ sáng ngày hôm qua, tôi đang gọi điện cho mẹ tôi"
                },
                {
                    "original": "In 2002, I was working at T&T company.",
                    "explanation": "Vào năm 2002, tôi vẫn đang làm việc cho công ty T&T"
                }
            ],
            "video_url": null
        },
        {
            "title": "Công thức quá khứ tiếp diễn (Past continuous)",
            "text": "Tương tự như các thì khác, thì quá khứ tiếp diễn cùng chia thành các trường hợp khẳng định, phủ định và nghi vấn.",
            "example": null,
            "image_url": "https://langmaster.edu.vn/storage/images/2022/11/08/qua-khu-tiep-dien-past-continuous.webp",
            "video_url": null
        },
        {
            "title": "1. Câu khẳng định",
            "text": "Cấu trúc: S + was/were + V-ing",
            "example": [
                {
                    "original": "She was planting trees in the forest at 4 p.m yesterday.",
                    "explanation": "Cô ấy đang trồng cây trong rừng lúc 4 giờ chiều ngày hôm qua"
                },
                {
                    "original": "I was going out when he arrived.",
                    "explanation": "Tôi đang ở ngoài trong khi anh ấy trở lại"
                },
                {
                    "original": "In 2010, we were working in a big town in America.",
                    "explanation": "Vào năm 2010, chúng tôi đang làm việc tại một thị trấn lớn ở Anh."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": "2. Câu phủ định",
            "text": "Cấu trúc: S + wasn’t/ weren’t + V-ing",
            "example": [
                {
                    "original": "They weren’t working at PC company in 1990.",
                    "explanation": "Họ đã không làm việc tại công ty PC vào năm 1990"
                },
                {
                    "original": "She wasn’t working when her boss came yesterday.",
                    "explanation": "Cô ta đang không làm việc khi sếp của cô ta trở lại vào ngày hôm qua"
                },
                {
                    "original": "I was not joking.",
                    "explanation": "Tôi đang không nói đùa"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": "3. Câu nghi vấn",
            "text": "Cấu trúc: Was/ Were + S + V-ing ?",
            "example": null,
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Trả lời: Yes, S + was/ were hoặc No, S + wasn’t/ weren’t.",
            "example": [
                {
                    "original": "Was he playing badminton while I was doing homework?",
                    "explanation": "Có phải anh ấy đang chơi cầu lông trong khi tôi làm bài tập đúng không?"
                },
                {
                    "original": "Was she going to the market at 6 pm yesterday?",
                    "explanation": "Có phải cô ấy đi chợ vào lúc 6 giờ chiều hôm qua không?"
                },
                {
                    "original": "Were you doing housework at 2 pm yesterday?",
                    "explanation": "Có phải bạn đang làm bài tập lúc 2 giờ chiều hôm qua không?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": "Cách dùng thì quá khứ tiếp diễn (Past continuous)",
            "text": "Diễn tả một hành động hoặc sự việc xảy ra tại một thời điểm xác định trong quá khứ. Sự việc ấy vẫn tiếp diễn cho đến một thời điểm khác.",
            "example":  [
                {
                    "original": "At 9 pm, my family was watching TV.",
                    "explanation": "Lúc 9 giờ tối, gia đình tôi đang xem TV"
                },
                {
                    "original": "At 6 am yesterday, I was going to the hospital.",
                    "explanation": "Lúc 6 giờ sáng ngày hôm qua, tôi đang đi bệnh viện"
                },
                {
                    "original": "My mom was cooking at 6 p.m yesterday.",
                    "explanation": "Mẹ tôi đang nấu ăn vào lúc 6 giờ tối hôm qua"
                }
            ],
            "image_url":null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Diễn tả hai hay nhiều hành động đang xảy ra đồng thời trong quá khứ.",
            "example": [
                {
                    "original": "I was reading while he was listening to music.",
                    "explanation": "Tôi đang đọc sách trong khi anh ấy đang nghe nhạc"
                },
                {
                    "original": "He was playing soccer while they were doing homework.",
                    "explanation": "Anh ta đang chơi bóng đá khi họ đang làm bài tập về nhà"
                },
                {
                    "original": "I was driving when he was singing.",
                    "explanation": "Tôi đang lái xe trong khi anh ta đang hát"
                }
            ],
            "image_url": "https://langmaster.edu.vn/storage/images/2022/10/06/thi-qua-khu-tiep-dien-1.webp",
            "video_url": null
        },
        {
            "title":null,
            "text": "Diễn tả một hoạt động đang diễn ra thì bất chợt có hành động khác xen vào.",
            "example":  [
                {
                    "original": "When Linh came, I was cooking dinner.",
                    "explanation": "Khi Linh tới, tôi đang nấu bữa tối"
                },
                {
                    "original": "I met him when I was going shopping yesterday.",
                    "explanation": "Tôi gặp anh ta khi đang đi mua sắm ngày hôm qua"
                },
                {
                    "original": "The light broke when I was washing my clothes.",
                    "explanation": "Cái bóng đèn bị vỡ khi tôi đang giặt quần áo"
                }
            ],
            "image_url":null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Diễn tả một hành động được lặp đi lặp lại trong quá khứ khiến người khác cảm thấy khó chịu.",
            "example": [
                {
                    "original": "He was always forgetting his key when he went out.",
                    "explanation": "Anh ta lúc nào cùng quên mang chìa khóa khi đi ra khỏi nhà"
                },
                {
                    "original": "I was always forgetting my boyfriend’s birthday.",
                    "explanation": "Tôi luôn quên mất ngày sinh nhật của bạn trai"
                },
                {
                    "original": "She was always complaining about her mother.",
                    "explanation": "Cô ta luôn than phiền về mẹ của mình"
                }
            ],
            "image_url": "https://langmaster.edu.vn/storage/images/2022/10/06/thi-qua-khu-tiep-dien-6.webp",
            "video_url": null
        },
        {
            "title": "Dấu hiệu thì quá khứ tiếp diễn",
            "text": "1. Những từ chỉ thời gian",
            "example": null,
            "image_url":null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Những trạng từ chỉ thời gian như at, in.",
            "example": [
                {
                    "original": "In 2015, I was living in China.",
                    "explanation": "Năm 2015 tôi đang ở Trung Quốc"
                },
                {
                    "original": "She was studying Math at 9 pm last night.",
                    "explanation": "9 giờ tối hôm qua cô ấy đang học môn toán"
                },
                {
                    "original": "We were watching TV at 11 pm last night.",
                    "explanation": "Chúng tôi đang xem TV vào lúc 11 giờ tối hôm qua"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Cụm từ chỉ thời gian như At that time, at this time, in the past.",
            "example": [
                {
                    "original": "I was watching TV at that time.",
                    "explanation": "Lúc đó tôi đang xem TV"
                },
                {
                    "original": "My sister was playing a game at that time.",
                    "explanation": "Lúc đó em gái tôi đang chơi trò chơi"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "2. Trong một số cấu trúc câu nhất định",
            "example": [
                {
                    "original": "He was always forgetting his bag when he went out.",
                    "explanation": "Anh ta lúc nào cùng quên mang cặp khi đi ra khỏi nhà"
                },
                {
                    "original": "I was reading the newspaper while he was listening to music.",
                    "explanation": "Tôi đang đọc báo trong khi anh ấy đang nghe nhạc"
                },
                {
                    "original": "When she came, I was cooking dinner.",
                    "explanation": "Khi cô ấy tới, tôi đang nấu bữa tối"
                }
            ],
            "image_url": null,
            "video_url": null
        }
    ]
}