{
    "title": "Cách sử dụng mạo từ trong tiếng Anh",
    "description": "Mạo từ được sử dụng khá phổ biến trong văn nói cũng như văn viết. Tuy nhiên, cách sử dụng mạo từ trong tiếng Anh như thế nào cho đúng? Hãy cùng tìm hiểu ngay dưới đây.",
    "content": [
        {
            "title": "1. Cách sử dụng các mạo từ a, an ",
            "text": "Cách dùng mạo từ “a”:",
            "example":null,
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "A là một mạo từ không xác định trong tiếng Anh, thường bắt đầu bằng một phụ âm. Tuy nhiên, một số trường hợp bắt đầu bằng nguyên âm nhưng được phát âm như phụ âm thì vẫn sử dụng “a”.",
            "example":[
                {
                    "original": "a uniform",
                    "explanation": "một bộ đồng phục"
                },
                {
                    "original": " a universal truth",
                    "explanation": "một sự thật phổ quát"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "A được dùng với một số thành ngữ chỉ tốc độ, giá cả, tỉ lệ hoặc các phân số.",
            "example":[
                {
                    "original":"a one second (½), 3 times a day, $2 a kilo"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "A được dùng với các số đếm, hoặc các thành ngữ nhất định về số lượng.",
            "example":[
                {
                    "original":"a one thousand (1000), a couple ( một cặp đôi ), a lots (nhiều)"
                }
            ],
            "image_url": "https://langmaster.edu.vn/storage/images/2022/10/11/mao-tu-trong-tieng-anh-3.webp",
            "video_url": null
        },
        {
            "title": null,
            "text": "Cách dùng mạo từ “an”: Mạo từ “an” được sử dụng đối với các danh từ bắt đầu bằng nguyên âm (u, e, a, i, o). Hoặc một số từ bắt đầu bằng phụ âm nhưng là âm câm (không được phát âm).",
            "example":[
                {
                    "original":"an egg, an apple, an hour, an MC"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": "Các trường hợp ko dùng a, an",
            "text": "Không sử dụng a, an trước các danh từ số nhiều.",
            "example":[
                {
                    "original":"An apple => Apples; An egg => Eggs"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Không dùng a và an trước các danh từ không đếm được hoặc các danh từ trừu tượng.",
            "example": [
                {
                    "original": " What I need now is confidence.",
                    "explanation": "Điều tôi cần bây giờ là sự tự tin."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Không dùng mạo từ không xác định trước tên gọi của các bữa ăn, trừ khi có tính từ đứng trước các bữa ăn đó.",
            "example": [
                {
                    "original": " I eat breakfast at 6 o'clock so I can get to school in time.",
                    "explanation": "Tôi ăn bữa sáng lúc 6 giờ để kịp đến trường."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": "2. Cách sử dụng mạo từ “the”, các trường hợp không dùng mạo từ the",
            "text": "Cách dùng mạo từ “the” trong tiếng Anh: “The” là mạo từ xác định dùng cho danh từ chỉ đối tượng xác định (người nghe và người nói đều biết rõ đối tượng đang nói đến là ai). Được dùng trong các trường hợp sau:",
            "example":null,
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Khi vật thể hay nhóm vật thể là duy nhất hoặc được xem là duy nhất.",
            "example": [
                {
                    "original": "The sun (mặt trời, the world (thế giới), the earth (trái đất)"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Trước một danh từ nếu danh từ này vừa được đề cập trước đó.",
            "example": [
                {
                    "original": "I see a dog. The dog is chasing a cat. The cat is chasing a mouse. ",
                    "explanation": "Tôi thấy 1 chú chó. Chú chó đó đang đuổi theo 1 con mèo. Con mèo đó đang đuổi theo 1 con chuột."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Trước một danh từ nếu danh từ này được xác định bằng 1 cụm từ hoặc 1 mệnh đề.",
            "example": [
                {
                    "original": "The teacher that I met yesterday is my sister in law",
                    "explanation": "Cô giáo tôi gặp hôm qua là chị dâu tôi."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Dùng “the” nếu ta nhắc đến một địa điểm nào đó nhưng không được sử dụng với đúng chức năng.",
            "example": [
                {
                    "original": "They went to the school to see their children",
                    "explanation": "Họ đến trường để thăm con cái họ"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Đặt trước một danh từ chỉ một đồ vật riêng biệt mà người nói và người nghe đều hiểu.",
            "example": [
                {
                    "original": "Please pass the jar of honey",
                    "explanation": "Làm ơn hãy đưa cho tôi lọ mật ong với."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Trước so sánh nhất (đứng trước first, second, only..) khi các từ này được dùng như tính từ hoặc đại từ.",
            "example": [
                {
                    "original": "You are the best in my life.",
                    "explanation": "Trong đời anh, em là nhất!"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "The + danh từ số ít: tượng trưng  cho một nhóm thú vật hoặc đồ vật.",
            "example": [
                {
                    "original": "The whale is in danger of becoming extinct ",
                    "explanation": "Cá voi đang trong nguy cơ tuyệt chủng."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Đặt “the” trước một tính từ để chỉ một nhóm người nhất định.",
            "example": [
                {
                    "original": "The old (Người già), the poor (người nghèo), the rich (người giàu)"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "The được dùng trước những danh từ riêng chỉ biển, sông, quần đảo, dãy núi, tên gọi số nhiều của các nước, sa mạc, miền.",
            "example": [
                {
                    "original": "The Pacific (Thái Bình Dương), The United States (Hợp chủng quốc Hoa Kỳ), the Alps (Dãy An pơ)."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "The + họ (ở dạng số nhiều) có nghĩa là gia đình.",
            "example": [
                {
                    "original": " The Smiths (Gia đình Smith (gồm vợ và các con), The Browns (Gia đình Brown)."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Trước tên quốc gia số ít, châu lục, tên núi, hồ, đường phố (Ngoại trừ những nước theo chế độ Liên bang – gồm nhiều bang state)",
            "example":[
                {
                    "original": "Europe, Asia, France, Wall Street, Sword Lake"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Khi danh từ không đếm được hoặc danh từ số nhiều dùng theo nghĩa chung chung, không chỉ riêng trường hợp nào.",
            "example": [
                {
                    "original": "Oranges are good for health",
                    "explanation":"Cam rất tốt cho sức khỏe"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Trước danh từ trừu tượng, trừ khi danh từ đó chỉ một trường hợp cá biệt.",
            "example": [
                {
                    "original": "Men fear death.The death of his father made him completely hopeless.",
                    "explanation": "Đàn ông sợ hãi cái chết. Cái chết của cha khiến anh hoàn toàn tuyệt vọng."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Ta không dùng “the” sau tính từ sở hữu hoặc sau danh từ ở dạng sở hữu cách. ",
            "example": [
                {
                    "original": "My friend, không phải “my the friend”; The man’s wife không phải “the wife of the man”"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Không dùng “the” trước tên gọi các bữa ăn hay tước hiệu. ",
            "example": [
                {
                    "original": "They invited some close friends to dinner",
                    "explanation": "Họ đã mời vài người bạn thân đến ăn tối."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Không dùng “the” trong các trường hợp nhắc đến danh từ với nghĩa chung chung khác như chơi thể thao, các mùa trong năm hay phương tiện đi lại.",
            "example": [
                {
                    "original": "Come by car/ by bus (Đến bằng xe ô tô, bằng xe buýt); In spring/ in Autumn (trong mùa xuân,mùa thu), from beginning to end (từ đầu tới cuối), from left to right (từ trái qua phải)."
                }
            ],
            "image_url": "https://langmaster.edu.vn/storage/images/2022/10/11/mao-tu-trong-tieng-anh-5.webp",
            "video_url": null
        },
        {
            "title": "Một số trường hợp không dùng mạo từ",
            "text": "Không sử dụng các mạo từ khi nói về điều gì đó chung chung hoặc trừu tượng.",
            "example": [
                {
                    "original": " I love watching fish",
                    "explanation": "Tôi thích ngắm nhìn đàn cá"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Không sử dụng mạo từ khi để cập đến một đất nước hoặc bữa ăn trong ngày.",
            "example": [
                {
                    "original": "Have you had breakfast?",
                    "explanation": "Bạn đã ăn sáng chưa?"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Không sử dụng mạo từ khi nói về các danh từ không đếm được.",
            "example": [
                {
                    "original": "Sugar is not good for obese people. ",
                    "explanation":"Đường không tốt cho người béo phì."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Không sử dụng mạo từ khi nói về ngôn ngữ, thị trấn hoặc một ngọn núi nào đó.",
            "example": [
                {
                    "original": "English, China, Paris."
                }
            ],
            "image_url":"https://langmaster.edu.vn/storage/images/2022/10/11/mao-tu-trong-tieng-anh-6.webp",
            "video_url": null
        }
    ]
}