{
  "title": "Một số mẫu câu tường thuật đặc biệt",
  "description": null,
  "content": [
    {
      "title": "1. Câu tường thuật cảm thán",
      "text": "Để chuyển câu cảm tưởng từ câu trực tiếp sang câu tường thuật, chúng ta thường sử dụng các từ giới thiệu như \"exclaimed\", \"cried out\", \"said with excitement\", “give an exclamation of”...",
      "example": [
        {
          "original": "Câu trực tiếp (direct speech): \"What a beautiful sunset!\" she exclaimed.",
          "explanation": "Cô ấy thốt lên rằng: \"Mặt trời lặn thật đẹp!\""
        },
        {
          "original": "Câu tường thuật (reported speech): She exclaimed that it was such a beautiful sunset.",
          "explanation": "Cô ấy thốt lên rằng đó là một cảnh hoàng hôn thật đẹp."
        },
        {
          "original": "Câu trực tiếp (direct speech): \"Wow! I can't believe it!\" he cried out.",
          "explanation": "Anh ấy la lên rằng: \"Thật không thể tin được!\""
        },
        {
          "original": "Câu tường thuật (reported speech): He cried out that he couldn't believe it.",
          "explanation": "Anh ấy la lên rằng anh ấy không thể tin được."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": null,
      "text": "Để thuật lại một số câu cảm thán như: Oh!, Marvelous!, Astonishing!, Eww!,..., ta có thể sử dụng cấu trúc \"give an exclamation of + N\" hoặc \"with an exclamation of + N, mệnh đề\" để diễn tả lại cảm xúc của người nói trong câu tường thuật.",
      "example": [
        {
          "original": "Câu trực tiếp (direct speech): \"Marvelous!\" he said.",
          "explanation": "\"Tuyệt vời!\" Anh ta nói."
        },
        {
          "original": "Câu tường thuật (reported speech): He gave an exclamation of admiration.",
          "explanation": "Anh thốt lên một tiếng thán phục."
        },
        {
          "original": "Câu trực tiếp (direct speech): \"Fantastic!\" he cheered as the team scored a goal.",
          "explanation": "\"Tuyệt vời!\" Anh ta hoan hô khi đội ghi bàn thắng."
        },
        {
          "original": "Câu tường thuật (reported speech): With an exclamation of excitement, he cheered as the team scored a goal.",
          "explanation": "Anh reo lên phấn khích khi đội ghi được bàn thắng."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": "2. Chuyển câu trả lời Yes/No trong câu tường thuật",
      "text": "\"Yes\" và \"No\" trong lời nói gián tiếp thường được diễn đạt bằng cách sử dụng cấu trúc \"Chủ ngữ + trợ động từ thích hợp\" trong câu tường thuật. Dưới đây là một số ví dụ minh họa:",
      "example": [
        {
          "original": "She asked if I would attend the meeting.",
          "explanation": "Cô ấy hỏi tôi có tham dự cuộc họp không."
        },
        {
          "original": "=>  I said I would.",
          "explanation": "Tôi đã nói là có."
        },
        {
          "original": "She inquired if he could swim.",
          "explanation": "Cô ấy hỏi liệu anh ấy có biết bơi không."
        },
        {
          "original": "=> He said he couldn't.",
          "explanation": "Anh ấy nói là không."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": "3. Câu tường thuật đặc biệt dạng to V",
      "text": "Câu tường thuật lời khuyên:\nĐể chuyển đổi lời khuyên từ câu trực tiếp sang câu tường thuật, chúng ta có thể sử dụng các cấu trúc như \"advised + S + (not) to V + O\" hoặc \"suggested + that + S + (should) V + O\". ",
      "image_url": null,
      "example": [
        {
          "original": "Câu trực tiếp (direct speech): \"You should study hard for the exam,\" the teacher said.",
          "explanation": "Thầy giáo bảo tôi: \"Con nên học tập chăm chỉ cho kỳ thi.\""
        },
        {
          "original": "Câu tường thuật (reported speech): The teacher advised me to study hard for the exam.",
          "explanation": "Thầy giáo khuyên tôi nên học tập chăm chỉ cho kỳ thi."
        },
        {
          "original": "Câu trực tiếp (direct speech): \"If I were you, I wouldn't take that risk,\" she said.",
          "explanation": "Cô ấy bảo: \"Nếu là tôi, tôi sẽ không mạo hiểm điều đó đâu\"."
        },
        {
          "original": "Câu tường thuật (reported speech): She suggested that I shouldn't take that risk.",
          "explanation": "Cô ấy khuyên tôi không nên mạo hiểm điều đó."
        },
        {
          "original": "Câu trực tiếp (direct speech): \"Why don't we go for a walk?\" he suggested.",
          "explanation": "Anh ấy gợi ý: \"Đi dạo không?\"."
        },
        {
          "original": "Câu tường thuật (reported speech): He suggested that we should go for a walk.",
          "explanation": "Anh ấy gợi ý chúng tôi nên đi dạo."
        }
      ],
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật cảnh báo:\nĐể tạo thành câu tường thuật cảnh báo, chúng ta có thể sử dụng các cấu trúc như \"warned + that + S + (should) V + O\" hoặc \"advised + that + S + (should) V + O\". ",
      "example": [
        {
          "original": "Câu trực tiếp (direct speech): \"Be careful! The road is bumpy,\" the policeman said.",
          "explanation": "\"Hãy cẩn thận! Con đường này xóc đấy\" người cảnh sát nói"
        },
        {
          "original": "Câu tường thuật (reported speech): The policeman warned that the road was bumpy.",
          "explanation": "Cảnh sát cảnh báo rằng con đường đó xóc."
        },
        {
          "original": "Câu trực tiếp (direct speech): \"Be careful with that knife! It's very sharp,\" the chef said.",
          "explanation": "Đầu bếp dặn: \"Hãy cẩn thận với con dao đó! Nó rất sắc."
        },
        {
          "original": "Câu tường thuật (reported speech): The chef advised that I should be careful with the knife as it was very sharp.",
          "explanation": "Đầu bếp khuyên tôi nên cẩn thận với con dao vì nó rất sắc."
        }
      ],
      "image_url": "https://langmaster.edu.vn/storage/images/2023/07/20/cau-tuong-thuat-1.webp",
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật cho phép:\nĐể chuyển câu cho phép từ câu trực tiếp sang câu tường thuật, chúng ta có thể sử dụng các cấu trúc như \"allowed + S + to V + O\" hoặc \"gave/granted permission for + S + to V + O\".",
      "example": [
        {
          "original": "Câu trực tiếp (direct speech): \"You can use my laptop,\" she said.",
          "explanation": "\"Bạn có thể dùng máy tính xách tay của tôi\" cô ấy nói"
        },
        {
          "original": "Câu tường thuật (reported speech): She allowed me to use her laptop.",
          "explanation": "Cô ấy cho phép tôi dùng máy tính xách tay của cô ấy."
        },
        {
          "original": "Câu trực tiếp (direct speech): \"The manager permitted us to leave early today,\" the employees said.",
          "explanation": "Nhân viên nói: \"Quản lý cho phép chúng tôi về sớm hôm nay\"."
        },
        {
          "original": "Câu tường thuật (reported speech): The employees said that the manager gave permission for them to leave early today.",
          "explanation": "Nhân viên nói rằng quản lý đã cho phép họ về sớm hôm nay."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật lời hứa:\nĐể chuyển đổi một lời hứa từ câu trực tiếp sang câu tường thuật, chúng ta có thể sử dụng cấu trúc \"promised + that + S + would + V + O\" hoặc \"made a promise + that + S + would + V + O\".",
      "example": [
        {
          "original": "Câu trực tiếp (direct speech): \"I promise I will help you with your project,\" she said.",
          "explanation": "\"Tôi hứa tôi sẽ giúp đỡ dự án của bạn\" cô ấy nói"
        },
        {
          "original": "Câu tường thuật (reported speech): She promised that she would help me with my project.",
          "explanation": "Cô ấy hứa rằng cô ấy sẽ giúp đỡ dự án của tôi."
        },
        {
          "original": "Câu trực tiếp (direct speech): \"We promise that we would always be there for each other,\" they said.",
          "explanation": "\"Chúng ta sẽ luôn ở bên nhau\" họ nói"
        },
        {
          "original": "Câu tường thuật (reported speech): They made a promise that they would always be there for each other.",
          "explanation": "Họ hứa rằng họ sẽ luôn ở bên nhau."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật lời đe doạ: Để chuyển đổi lời đe dọa từ câu trực tiếp sang câu tường thuật, chúng ta có thể sử dụng cấu trúc \"threatened + that + S + would + V + O\" hoặc \"made a threat + that + S + would + V + O\".",
      "example": [
        {
          "original": "Câu trực tiếp: \"I will hurt you if you don't do what I say!\" he said.",
          "explanation": "“Tôi sẽ làm tổn thương bạn nếu bạn không làm theo những gì tôi nói!” anh ấy nói."
        },
        {
          "original": "Câu tường thuật (reported speech): He threatened that he would hurt me if I didn't do what he said.",
          "explanation": "Anh ta đe dọa sẽ làm tổn thương tôi nếu tôi không làm theo những gì anh ta nói."
        },
        {
          "original": "Câu trực tiếp: \"They will face serious consequences if they betray us,\" the leader warned.",
          "explanation": "“Họ sẽ phải đối mặt với hậu quả nghiêm trọng nếu phản bội chúng ta”, nhà lãnh đạo cảnh báo."
        },
        {
          "original": "Câu tường thuật (reported speech): The leader made a threat that they would face serious consequences if they betrayed us.",
          "explanation": "Người đứng đầu đã đe dọa rằng họ sẽ phải chịu hậu quả nghiêm trọng nếu phản bội chúng tôi."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật lời nhắc nhở:\nĐể chuyển đổi lời nhắc nhở từ câu trực tiếp sang câu tường thuật, chúng ta có thể sử dụng cấu trúc \"reminded + S + (that) + S + (should) V + O\" hoặc \"gave a reminder + (that) + S + (should) V + O\".",
      "example": [
        {
          "original": "Câu trực tiếp: \"Remember to submit the report by the end of the day,\" the manager told the team.",
          "explanation": "“Hãy nhớ nộp báo cáo trước cuối ngày hôm nay,” người quản lý nói với nhóm."
        },
        {
          "original": "Câu tường thuật (reported speech): The manager reminded the team (that) they (should) submit the report by the end of the day.",
          "explanation": "Người quản lý nhắc nhở nhóm (rằng) họ (nên) nộp báo cáo trước cuối ngày hôm nay."
        },
        {
          "original": "Câu trực tiếp: \"This is a friendly reminder to pay your bills on time,\" the email stated.",
          "explanation": "“Đây là lời nhắc nhở thân thiện để bạn thanh toán hóa đơn đúng hạn,” email ghi."
        },
        {
          "original": "Câu tường thuật (reported speech): The email gave a reminder (that) I (should) pay my bills on time.",
          "explanation": "Email đã nhắc nhở (rằng) tôi (nên) thanh toán hóa đơn đúng hạn."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật lời cầu xin:\nĐể chuyển đổi lời cầu xin từ câu trực tiếp sang câu tường thuật, chúng ta có thể sử dụng cấu trúc “begged/implored + S + to V + O”.",
      "example": [
        {
          "original": "Câu trực tiếp: \"Please, forgive me for my mistake\" he said.",
          "explanation": "“Xin hãy tha thứ cho lỗi lầm của tôi,” anh nói."
        },
        {
          "original": "Câu tường thuật (reported speech):He begged (me) for forgiveness for his mistake.",
          "explanation": "Anh ấy cầu xin (tôi) tha thứ cho lỗi lầm của mình."
        },
        {
          "original": "Câu trực tiếp: \"I really need your help with this problem\" she said to her teacher.",
          "explanation": "\"Em thực sự cần sự giúp đỡ của cô về vấn đề này\" cô nói với giáo viên của mình."
        },
        {
          "original": "Câu tường thuật (reported speech): She implored her teacher to help her with this problem.",
          "explanation": "Cô cầu xin giáo viên giúp cô giải quyết vấn đề này."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật lời động viên:\nĐể chuyển đổi lời động viên từ câu trực tiếp sang câu tường thuật, chúng ta có thể sử dụng cấu trúc \"encouraged + S + (to) V + O\" hoặc \"gave encouragement + (to) S + to V + O\". ",
      "example": [
        {
          "original": "Câu trực tiếp: \"Please, forgive me for my mistake\" he said.",
          "explanation": "“Xin hãy tha thứ cho lỗi lầm của tôi,” anh nói."
        },
        {
          "original": "Câu tường thuật (reported speech):He begged (me) for forgiveness for his mistake.",
          "explanation": "Anh ấy cầu xin (tôi) tha thứ cho lỗi lầm của mình."
        },
        {
          "original": "Câu trực tiếp: \"I really need your help with this problem\" she said to her teacher.",
          "explanation": "\"Em thực sự cần sự giúp đỡ của cô về vấn đề này\" cô nói với giáo viên của mình."
        },
        {
          "original": "Câu tường thuật (reported speech): She implored her teacher to help her with this problem.",
          "explanation": "Cô cầu xin giáo viên giúp cô giải quyết vấn đề này."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật lời đề nghị giúp đỡ:\nĐể chuyển đổi lời đề xuất giúp đỡ từ câu trực tiếp sang câu tường thuật, chúng ta có thể sử dụng cấu trúc \"offered + (to) V + O\" hoặc \"proposed + (that) + S + (should) V + O\".",
      "example": [
        {
          "original": "Câu trực tiếp: \"Do you need any help with your assignment?\" she asked.",
          "explanation": "Cô ấy hỏi: \"Bạn có cần giúp bài tập không?\""
        },
        {
          "original": "Câu tường thuật: She offered to help me with my assignment.",
          "explanation": "Cô ấy đề nghị giúp tôi bài tập."
        },
        {
          "original": "Câu trực tiếp: \"Let's form a study group to prepare for the exam,\" she suggested to her classmates.",
          "explanation": "Cô ấy đề nghị với các bạn cùng lớp: \"Chúng ta hãy thành lập một nhóm học để chuẩn bị cho kỳ thi\"."
        },
        {
          "original": "Câu tường thuật: She proposed that they (should) form a study group to prepare for the exam.",
          "explanation": "Cô ấy đề xuất rằng họ (nên) thành lập một nhóm học để chuẩn bị cho kỳ thi."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật lời đồng ý/không đồng ý:\nĐể chuyển đổi sự đồng ý và không đồng ý từ câu trực tiếp sang câu tường thuật chúng ta sử dụng hai cấu trúc \"agreed +  to V + ...\" (đồng ý) hoặc \"refused + (to) V + O\" (từ chối).",
      "image_url": "https://langmaster.edu.vn/storage/images/2023/07/20/cau-tuong-thuat-2.webp",
      "example": [
        {
          "original": "Câu trực tiếp: \"Yes, I will help you with the presentation,\" she said.",
          "explanation": "Cô ấy nói: “Vâng, tôi sẽ giúp bạn với bài thuyết trình.”"
        },
        {
          "original": "Câu tường thuật: She agreed to help with the presentation.",
          "explanation": "Cô ấy đồng ý giúp đỡ bài thuyết trình."
        },
        {
          "original": "Câu trực tiếp: \"No, I won't lend you any money,\" she said.",
          "explanation": "Cô ấy nói: “Không, tôi sẽ không cho bạn vay bất kỳ khoản tiền nào.”"
        },
        {
          "original": "Câu tường thuật: She refused to lend any money.",
          "explanation": "Cô ấy từ chối cho vay bất kỳ khoản tiền nào."
        }
      ],
      "video_url": null
    },
    {
      "title": "4. Câu tường thuật đặc biệt dạng V-ing",
      "text": "Câu tường thuật lời buộc tội:\nĐể chuyển đổi lời buộc tội từ câu trực tiếp sang câu tường thuật, chúng ta có thể sử dụng các cấu trúc như \"accused + S + of + V-ing\" hoặc \"charged + S + with + V-ing\".",
      "image_url": null,
      "example": [
        {
          "original": "Câu trực tiếp: \"You stole my money!\" she said to him.",
          "explanation": "Cô ấy nói với anh ta: “Anh đã ăn cắp tiền của tôi!”"
        },
        {
          "original": "Câu tường thuật: She accused him of stealing her money.",
          "explanation": "Cô ấy buộc tội anh ta ăn cắp tiền của mình."
        },
        {
          "original": "Câu trực tiếp: \"He committed the crime,\" the detective said.",
          "explanation": "Thám tử nói: “Anh ta đã phạm tội.”"
        },
        {
          "original": "Câu tường thuật: The detective charged him with committing the crime.",
          "explanation": "Thám tử buộc tội anh ta phạm tội."
        }
      ],
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật lời đổ lỗi:\nĐể chuyển đổi lời đổ lỗi từ câu trực tiếp sang câu tường thuật, chúng ta có thể sử dụng các cấu trúc như \"blamed + S + for + V-ing\".",
      "example": [
        {
          "original": "Câu trực tiếp: \"You broke the vase!\" she said to him.",
          "explanation": "Cô ấy nói với anh ấy: “Anh đã làm vỡ bình hoa!”"
        },
        {
          "original": "Câu tường thuật: She blamed him for breaking the vase.",
          "explanation": "Cô ấy đổ lỗi cho anh ấy vì đã làm vỡ bình hoa."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật lời thú tội, thừa nhận:\nĐể chuyển đổi lời thú tội hoặc thừa nhận từ câu trực tiếp sang câu tường thuật chúng ta có thể sử dụng cấu trúc \"confessed to + V-ing\" hoặc \"admitted + V-ing/having V(p2)\"",
      "example": [
        {
          "original": "Câu trực tiếp: \"I broke the window,\" he said.",
          "explanation": "\"Tôi đã đập vỡ của sổ\" anh ấy nói"
        },
        {
          "original": "Câu tường thuật: He confessed to breaking the window.",
          "explanation": "Anh ấy thú nhận đã đập vỡ cửa sổ."
        },
        {
          "original": "Câu trực tiếp: \"Yes, I made a mistake,\" she said.",
          "explanation": "\"Tôi đã mắc sai lầm.\" cô ấy nói"
        },
        {
          "original": "Câu tường thuật: She admitted making/having made a mistake.",
          "explanation": "Cô ấy thừa nhận đã mắc sai lầm."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật lời phủ nhận:\nĐể chuyển đổi lời phủ nhận từ câu trực tiếp sang câu tường thuật chúng ta có thể sử dụng các cấu trúc như \"denied + V-ing/having V(p2)\". ",
      "example": [
        {
          "original": "Câu trực tiếp: \"I didn't steal the money,\" he said.",
          "explanation": "Anh ấy nói: “Tôi không lấy trộm tiền”."
        },
        {
          "original": "Câu tường thuật: He denied stealing the money.",
          "explanation": "Anh ấy phủ nhận việc lấy trộm tiền."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật lời xin lỗi:\nĐể chuyển đổi lời xin lỗi từ câu trực tiếp sang câu tường thuật chúng ta có thể sử dụng cấu trúc \"apologized (to sb) + (for + N/V-ing)\" hoặc \"said sorry + (for + N/V-ing)\". ",
      "example": [
        {
          "original": "Câu trực tiếp: \"I'm sorry for being late,\" she said.",
          "explanation": "\"Tôi xin lỗi vì đến muộn.\" cô ấy nói"
        },
        {
          "original": "Câu tường thuật: She apologized for being late.",
          "explanation": "Cô ấy xin lỗi vì đến muộn."
        },
        {
          "original": "Câu trực tiếp: \"I'm sorry for my mistake,\" he said.",
          "explanation": "\"Tôi xin lỗi vì sai lầm của mình.\" anh ấy nói"
        },
        {
          "original": "Câu tường thuật: He said sorry for his mistake.",
          "explanation": "Anh ấy xin lỗi vì sai lầm của mình."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật lời cảm ơn:\nĐể chuyển đổi lời cảm ơn từ câu trực tiếp sang câu tường thuật chúng ta có thể sử dụng cấu trúc \"thanked + S + for + N/V-ing\" hoặc \"expressed gratitude + to + S + for + N/V-ing\". ",
      "example": [
        {
          "original": "Câu trực tiếp: \"Thank you for helping me,\" she said.",
          "explanation": "Cô ấy nói: “Cảm ơn bạn đã giúp tôi.”"
        },
        {
          "original": "Câu tường thuật: She thanked me for helping her.",
          "explanation": "Cô ấy cảm ơn tôi đã giúp cô ấy."
        },
        {
          "original": "Câu trực tiếp: \"Thank you for coming to the party,\" they said.",
          "explanation": "Họ nói: “Cảm ơn bạn đã đến dự tiệc.”"
        },
        {
          "original": "Câu tường thuật: They expressed gratitude to him for coming to the party.",
          "explanation": "Họ bày tỏ lòng biết ơn anh ấy vì đã đến dự tiệc."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật lời khen ngợi:\nĐể thuật lại lời khen ngợi trong câu tường thuật, chúng ta có thể sử dụng cấu trúc \"praised + S + for + V-ing\" hoặc \"complimented/congratulated + S + on + N/V-ing\".",
      "example": [
        {
          "original": "Câu trực tiếp: \"You are an excellent leader,\" the team members said.",
          "explanation": "Các thành viên trong nhóm nói với anh ấy: “Anh là một nhà lãnh đạo xuất sắc”."
        },
        {
          "original": "Câu tường thuật: The team members complimented him on being an excellent leader.",
          "explanation": "Các thành viên trong nhóm khen ngợi anh ấy là một nhà lãnh đạo xuất sắc."
        },
        {
          "original": "Câu trực tiếp: \"Congratulations on your new book,\" the publisher said.",
          "explanation": "Nhà xuất bản nói với tác giả: “Chúc mừng về cuốn sách mới của bạn”."
        },
        {
          "original": "Câu tường thuật: The publisher congratulated the author on their new book.",
          "explanation": "Nhà xuất bản chúc mừng tác giả về cuốn sách mới của họ."
        }
      ],
      "image_url": "https://langmaster.edu.vn/storage/images/2023/07/20/cau-tuong-thuat-3.webp",
      "video_url": null
    },
    {
      "title": null,
      "text": "Câu tường thuật sự quả quyết:\nĐể thuật lại sự quả quyết từ câu trực tiếp sang câu tường thuật chúng ta có thể sử dụng các cấu trúc như \"insisted + on + V-ing\" hoặc \"was/were determined to + V\". ",
      "example": [
        {
          "original": "Câu trực tiếp: \"I will finish this project on time,\" she said.",
          "explanation": "Cô ấy nói: “Tôi sẽ hoàn thành dự án này đúng giờ”."
        },
        {
          "original": "Câu tường thuật: She insisted on finishing the project on time.",
          "explanation": "Cô ấy khăng khăng muốn hoàn thành dự án đúng giờ."
        },
        {
          "original": "Câu trực tiếp: \"I want to join the team,\" she said.",
          "explanation": "Cô ấy nói: “Tôi muốn tham gia vào nhóm”."
        },
        {
          "original": "Câu tường thuật: She was determined to join the team.",
          "explanation": "Cô ấy quyết tâm tham gia vào nhóm."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": "5. Câu tường thuật ước nguyện",
      "text": "Để chuyển đổi câu ước nguyện từ câu trực tiếp sang câu tường thuật, chúng ta có thể sử dụng các cấu trúc như \"wished + that + S + (would/could/might) V + O\" hoặc \"expressed a wish + that + S + (would/could/might) V + O\". ",
      "example": [
        {
          "original": "Câu trực tiếp: \"I wish I could travel around the world,\" she said.",
          "explanation": "Cô ấy nói: \"Ước gì tôi có thể đi du lịch vòng quanh thế giới\"."
        },
        {
          "original": "Câu tường thuật: She wished that she could travel around the world.",
          "explanation": "Cô ấy ước rằng mình có thể đi du lịch vòng quanh thế giới."
        },
        {
          "original": "Câu trực tiếp: \"I wish it would stop raining,\" he said.",
          "explanation": "Anh ấy nói: \"Ước gì trời ngừng mưa\"."
        },
        {
          "original": "Câu tường thuật: He expressed a wish that it would stop raining.",
          "explanation": "Anh ấy bày tỏ mong ước trời ngừng mưa."
        }
      ],
      "image_url": null,
      "video_url": null
    },
    {
      "title": "6. Câu tường thuật với Needn’t",
      "text": "Khi câu trực tiếp chứa từ \"needn't\" chúng ta thường sử dụng cấu trúc \"didn't have to\" trong câu tường thuật để diễn đạt ý nghĩa tương đương. ",
      "example": [
        {
          "original": "Câu trực tiếp: \"You needn't attend the meeting tomorrow,\" she said.",
          "explanation": "Cô ấy nói: “Bạn không cần tham dự cuộc họp vào ngày mai”."
        },
        {
          "original": "Câu tường thuật: She said (that) I didn't have to attend the meeting tomorrow.",
          "explanation": "Cô ấy nói rằng tôi không cần tham dự cuộc họp vào ngày mai."
        }
      ],
      "image_url": null,
      "video_url": null
    }
  ]
}