{
    "title": "General Appearance - Ngoại hình tổng quan",
    "description": "Khi chúng ta có một người bạn rất thú vị và đặc biệt và chúng ta muốn miêu tả người đó cho bạn bè của mình biết .Vậy chúng ta nói bằng tiếng Anh thì như thế nào? Chúng ta nên dùng từ vựng nào?",
    "content": [
        {
            "title": "Beautiful - Đẹp",
            "text": null,
            "example": [
                {
                    "original": "Her smile was beautiful, and it lit up the entire room.",
                    "explanation": "Nụ cười của cô ấy rất đẹp, và nó làm sáng cả căn phòng."
                }
            ],
            "image_url": "images/objects/general_appearance/beautiful.png",
            "video_url": null
        },
        {
            "title": "Pretty - Xinh đẹp",
            "text": null,
            "example": [
                {
                    "original": "She was a pretty",
                    "explanation": "Cô ấy rất xinh đẹp"
                }
            ],
            "image_url": "images/objects/general_appearance/pretty.png",
            "video_url": null
        },
        {
            "title": "Elegant - Thanh lịch",
            "text": null,
            "example": [
                {
                    "original": "She was elegant in her long black dress.",
                    "explanation": "Cô ấy rất thanh lịch trong chiếc váy đen dài của mình."
                }
            ],
            "image_url": "images/objects/general_appearance/elegant.png",
            "video_url": null
        },
        {
            "title": "Funny - Vui tính",
            "text": null,
            "example": [
                {
                    "original": "She was funny and made everyone laugh.",
                    "explanation": "Cô ấy rất vui tính và làm cho mọi người cười."
                }
            ],
            "image_url": "images/objects/general_appearance/funny.png",
            "video_url": null
        },
        {
            "title": "Cute - Dễ thương",
            "text": null,
            "example": [
                {
                    "original": "She was cute and had a sweet smile.",
                    "explanation": "Cô ấy rất dễ thương và có nụ cười ngọt ngào."
                }
            ],
            "image_url": "images/objects/general_appearance/cute.png",
            "video_url": null
        },
        {
            "title": "Handsome - Đẹp trai",
            "text": null,
            "example": [
                {
                    "original": "He was handsome and had a charming smile.",
                    "explanation": "Anh ấy rất đẹp trai và có nụ cười quyến rũ."
                }
            ],
            "image_url": "images/objects/general_appearance/handsome.png",
            "video_url": null
        },
        {
            "title": "Gorgeous - Rất đẹp",
            "text": null,
            "example": [
                {
                    "original": "The actress looked stunning on the red carpet, with her hair styled perfectly and wearing a gorgeous gown that showed off her figure.",
                    "explanation": "Nữ diễn viên trông rất đẹp trên thảm đỏ, với mái tóc được cắt tỉa hoàn hảo và mặc một chiếc váy rất đẹp để khoe vóc dáng của cô ấy."
                }
            ],
            "image_url": "images/objects/general_appearance/gorgeous.png",
            "video_url": null
        },
        {
            "title": "Sự khác biệt giữa Gorgeous và Beautiful và Pretty",
            "text": "rong ngữ cảnh của ngôn ngữ tiếng Anh, “gorgeous”, “beautiful” và “pretty” đều có nghĩa là đẹp. Tuy nhiên, chúng có một số sự khác biệt nhỏ về cách sử dụng và ý nghĩa. \n “gorgeous”: Từ này thường được sử dụng để miêu tả một cái gì đó rất đẹp, hấp dẫn và gây ấn tượng mạnh. Nó thường được dùng để miêu tả vẻ ngoài của một người, một đồ vật hoặc một cảnh quan đặc biệt. \n “beautiful”: Từ này có ý nghĩa chung hơn và có thể được sử dụng để miêu tả mọi thứ từ vẻ ngoài đến tính cách. Nó thường được sử dụng để miêu tả cái gì đó có vẻ đẹp tinh tế, duyên dáng và thú vị. \n “pretty”: Từ này thường được sử dụng để miêu tả cái gì đó có vẻ đẹp dễ thương, nhẹ nhàng và có sự thu hút nhất định. Nó thường được sử dụng để miêu tả vẻ ngoài của một người, đặc biệt là phụ nữ và trẻ em. \n Tóm lại, “gorgeous” thường được sử dụng để miêu tả cái gì đó rất đẹp và gây ấn tượng mạnh, “beautiful” có ý nghĩa chung hơn và “pretty” thường được sử dụng để miêu tả cái gì đó có vẻ đẹp dễ thương và nhẹ nhàng. Tuy nhiên, việc sử dụng từ này còn phụ thuộc vào ngữ cảnh và cảm nhận cá nhân của mỗi người.",
            "example": null,
            "image_url": null,
            "video_url": null
        },
        {
            "title": "Ugly - Xấu xí",
            "text": null,
            "example": [
                {
                    "original": "She was ugly and had a mean look on her face.",
                    "explanation": "Cô ấy rất xấu xí và có vẻ mặt xấu xa."
                }
            ],
            "image_url": "images/objects/general_appearance/ugly.png",
            "video_url": null
        }
    ]
}