{
    "title": "TỪ ĐỒNG NGHĨA TRONG TIẾNG ANH",
    "description": "Các từ đồng nghĩa trong tiếng Anh được sử dụng với mục đích giúp cho câu nói trở nên phong phú và không bị lặp từ. Cùng tìm hiểu thêm về từ đồng nghĩa và chỉ ra một số cặp từ được sử dụng nhiều nhất trong giao tiếp nhé!",
    "content": [
        {
            "title": "Từ đồng nghĩa",
            "text": "Từ đồng nghĩa hay trong tiếng Anh còn là những từ có ý nghĩa hoàn toàn như nhau hoặc tương đương về nghĩa nhưng có cách viết và đọc khác nhau. Các từ đồng nghĩa là các từ hoàn toàn khác nhau về hình thức nhưng biểu thị ý nghĩa giống nhau ở một số ngữ cảnh cụ thể.",
            "example": null,
            "image_url": "https://binggo.edu.vn/storage/images/2021/12/08/cac-tu-dong-nghia-trong-tieng-anh2.jpg",
            "video_url": null
        },
        {
            "title": " Phân loại cách cặp từ đồng nghĩa",
            "text": "1.  Từ đồng nghĩa tuyệt đối: Từ đồng nghĩa tuyệt đối trong tiếng Anh là những từ mang ý nghĩa và đặc điểm giống hệt nhau. Chúng có thể thay thế cho nhau trong mọi ngữ cảnh sử dụng.",
            "example": [
                {
                    "original": "Motherland = fatherland: Tổ quốc (nghĩa rộng), quê hương( nghĩa hẹp)"
                },
                {
                    "original": "My fatherland is Quang Ninh, Viet Nam = My motherland is Quang Ninh, Viet Nam.",
                    "explanation": "Quê hương của tôi ở Quảng Ninh, Việt Nam."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "2. Từ đồng nghĩa tương đối: Từ đồng nghĩa tương đối là những từ khác nhau về biểu thái cũng như ngữ nghĩa. Trong một số trường hợp chúng có thể hoặc không thay thế được cho nhau.",
            "example": [
                {
                    "original": "Look (nhìn đơn giản, nhìn sơ qua)= stare (nhìn một cách chằm chằm do tò mò về giới tính của ai đó) = gaze (cái nhìn chằm chằm do ngạc nhiên hoặc ngưỡng mộ ai đó) = glance (động tác liếc nhìn)"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "3. Từ đồng nghĩa khác biểu thái: Từ đồng nghĩa khác biểu thái là những từ có nghĩa chung, tương đương với nhau nhưng cách biểu đạt lại khác nhau.",
            "example": [
                {
                    "original": "Father = dad: Cha"
                },
                {
                    "original": "Mother = mom: Mẹ"
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "4. Từ đồng nghĩa tu từ: Từ đồng nghĩa tu từ là những từ hay cụm từ khác nhau về ý nghĩa tu từ và nghĩa bóng",
            "example": null,
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "to dismiss = to fire = to sack: đuổi, sa thải. Từ “to dismiss” có nghĩa là cho phép ai đó đi, mang ý nghĩa trung tính.",
            "example": [
                {
                    "original": "My teacher dismissed the class early 15th minutes.",
                    "explanation":"Cô giáo tôi cho phép lớp học nghỉ học sớm 15 phút."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "Từ “to fire” mang ý nghĩa của sự ép buộc, vì lý do gì đó mà bị sa thải.",
            "example": [
                {
                    "original": " Lan was fired from her last job for being slow.",
                    "explanation":"Lan bị sa thải khỏi công việc vì quá chậm chạp trong công việc."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title":null,
            "text": "Từ “to sack” mang ý nghĩa đuổi trực tiếp vì thiếu năng lực. Có thể hiểu là vì thiếu năng lực mà bị cho nghỉ việc.",
            "example": [
                {
                    "original": " One of the staff was sacked for disruptive. ",
                    "explanation":"Một trong những nhân viên bị sa thải vì gây rối."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "5. Từ đồng nghĩa lãnh thổ: Từ đồng nghĩa lãnh thổ là những từ tương tự nhau về ý nghĩa nhưng ở những vùng lãnh thổ khác nhau thì cách sử dụng lại khác nhau.",
            "example":  [
                {
                    "original": "Sidewalk = pavement: vỉa hè",
                    "explanation":"“Sidewalk” được dùng  nhiều ở Mỹ còn “pavement” được sử dụng ở các quốc gia lân cận khác."
                }
            ],
            "image_url": null,
            "video_url": null
        },
        {
            "title": null,
            "text": "6. Uyển ngữ, mỹ từ: Những từ đồng nghĩa trong tiếng Anh này được sử dụng để nhằm mục đích nói giảm, nói tránh. Chúng giúp giảm đi nỗi đau đớn hay sự khó chịu của ai đó. ",
            "example": [
                {
                    "original": "The underprivileged = the poor: Nghèo khó, nghèo khổ",
                    "explanation":"Hai từ này đều mang ý nghĩa là nghèo. Nhưng từ “The poor” sẽ mang ý nghĩa nặng nề, đau đớn. Còn từ “the underprivileged” mang ý nghĩa nói giảm, nói tránh thể hiện vẻ lịch sự, nhẹ nhàng trong khi giao tiếp."
                }
            ],
            "image_url": null,
            "video_url": null
        }
    ]
}